#### 🏗️ Terraform Plan Results

#### 📋 Format Check: `failure`
#### ⚡ Initialization: `success`
#### ✅ Validation: `success`
#### 📊 Plan: `failure`

<details><summary>📄 Show Plan</summary>

```terraform
terraform
module.networking.data.aws_availability_zones.available: Reading...
module.networking.data.aws_region.current: Reading...
module.networking.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.data.aws_caller_identity.current: Reading...
module.database.data.aws_region.current: Reading...
module.ecs.data.aws_region.current: Reading...
module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.data.aws_caller_identity.current: Read complete after 0s [id=253650698585]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.database.aws_db_parameter_group.main will be created
  + resource "aws_db_parameter_group" "main" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = "nurlan-yagublu-dev-postgres-params"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags         = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-postgres-params"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DBParameterGroup"
        }
      + tags_all     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-postgres-params"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DBParameterGroup"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "1000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_statement"
          + value        = "all"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "max_connections"
          + value        = "100"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pg_stat_statements"
        }
    }

  # module.database.aws_secretsmanager_secret.db_credentials will be created
  + resource "aws_secretsmanager_secret" "db_credentials" {
      + arn                            = (known after apply)
      + description                    = "Database credentials for nurlan-yagublu dev"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "nurlan-yagublu-dev-db-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-db-credentials"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DatabaseCredentials"
        }
      + tags_all                       = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-db-credentials"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DatabaseCredentials"
        }
    }

  # module.database.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.ecs.aws_cloudwatch_log_group.app will be created
  + resource "aws_cloudwatch_log_group" "app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/nurlan-yagublu-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-ecs-logs"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "CloudWatchLogGroup"
        }
      + tags_all          = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-logs"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "CloudWatchLogGroup"
        }
    }

  # module.ecs.aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "nurlan-yagublu-dev-flask-api"
    }

  # module.ecs.aws_ecr_repository.app will be created
  + resource "aws_ecr_repository" "app" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "nurlan-yagublu-dev-flask-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-ecr-repository"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECRRepository"
        }
      + tags_all             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecr-repository"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECRRepository"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "nurlan-yagublu-dev-cluster"
      + tags     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-ecs-cluster"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSCluster"
        }
      + tags_all = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-cluster"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSCluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.main will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "nurlan-yagublu-dev-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 70
        }
      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # module.ecs.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "nurlan-yagublu-dev-flask-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-task-definition"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSTaskDefinition"
        }
      + tags_all                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-task-definition"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSTaskDefinition"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_iam_role.ecs_execution_role will be created
  + resource "aws_iam_role" "ecs_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-ecs-execution-role"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-execution-role"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-ecs-task-role"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-task-role"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_logs_policy will be created
  + resource "aws_iam_role_policy" "ecs_logs_policy" {
      + id          = (known after apply)
      + name        = "nurlan-yagublu-dev-ecs-logs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_secrets_policy will be created
  + resource "aws_iam_role_policy" "ecs_secrets_policy" {
      + id          = (known after apply)
      + name        = "nurlan-yagublu-dev-ecs-secrets-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_task_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_policy" {
      + id          = (known after apply)
      + name        = "nurlan-yagublu-dev-ecs-task-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "nurlan-yagublu-dev-ecs-execution-role"
    }

  # module.ecs.aws_lb_target_group.app will be created
  + resource "aws_lb_target_group" "app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "nurlan-yagublu-dev-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-target-group"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ALBTargetGroup"
        }
      + tags_all                           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-target-group"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ALBTargetGroup"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.networking.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-nat-eip-1"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ElasticIP"
        }
      + tags_all             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-nat-eip-1"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ElasticIP"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-nat-eip-2"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ElasticIP"
        }
      + tags_all             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-nat-eip-2"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ElasticIP"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-igw"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "InternetGateway"
        }
      + tags_all = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-igw"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "InternetGateway"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_route_table.private_db will be created
  + resource "aws_route_table" "private_db" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-private-db-rt"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Database"
          + "Type"        = "RouteTable"
        }
      + tags_all         = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-private-db-rt"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Database"
          + "Type"        = "RouteTable"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-public-rt"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Public"
          + "Type"        = "RouteTable"
        }
      + tags_all         = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-public-rt"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Public"
          + "Type"        = "RouteTable"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "nurlan-yagublu-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-alb-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "LoadBalancer"
          + "Type"        = "SecurityGroup"
        }
      + tags_all               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-alb-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "LoadBalancer"
          + "Type"        = "SecurityGroup"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS services"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "nurlan-yagublu-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-ecs-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Application"
          + "Type"        = "SecurityGroup"
        }
      + tags_all               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Application"
          + "Type"        = "SecurityGroup"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "PostgreSQL from ECS"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "nurlan-yagublu-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-rds-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Database"
          + "Type"        = "SecurityGroup"
        }
      + tags_all               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-rds-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "Database"
          + "Type"        = "SecurityGroup"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.20.0/24",
                ]
              + description      = "HTTPS from private subnets"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "nurlan-yagublu-vpc-endpoints-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-vpc-endpoints-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "VPCEndpoints"
          + "Type"        = "SecurityGroup"
        }
      + tags_all               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-vpc-endpoints-sg"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Tier"        = "VPCEndpoints"
          + "Type"        = "SecurityGroup"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-vpc"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "VPC"
        }
      + tags_all                             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-vpc"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "VPC"
        }
    }

  # module.route53.aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "example.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.example.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "example.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.example.com",
          + "example.com",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-certificate"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-certificate"
          + "Project"     = "nurlan-yagublu"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.route53.aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.route53.aws_route53_record.cert_validation["*.example.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.route53.aws_route53_record.cert_validation["example.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.route53.aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "example.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-hosted-zone"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-hosted-zone"
          + "Project"     = "nurlan-yagublu"
        }
      + zone_id             = (known after apply)
    }

  # module.s3_static_website.aws_cloudfront_distribution.website[0] will be created
  + resource "aws_cloudfront_distribution" "website" {
      + aliases                         = [
          + "dev-app.example.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-static-website-cloudfront"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "CloudFrontDistribution"
        }
      + tags_all                        = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-static-website-cloudfront"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "CloudFrontDistribution"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "S3-nurlan-yagublu-dev-static-website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "S3-nurlan-yagublu-dev-static-website"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = (known after apply)
          + minimum_protocol_version       = (known after apply)
          + ssl_support_method             = (known after apply)
        }
    }

  # module.s3_static_website.aws_cloudfront_origin_access_control.website[0] will be created
  + resource "aws_cloudfront_origin_access_control" "website" {
      + arn                               = (known after apply)
      + description                       = "OAC for nurlan-yagublu-dev-static-website"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "nurlan-yagublu-dev-static-website-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.s3_static_website.aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nurlan-yagublu-dev-static-website"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-static-website"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "StaticWebsite"
        }
      + tags_all                    = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-static-website"
          + "Owner"       = "Nurlan-Dev"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "StaticWebsite"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_static_website.aws_s3_bucket_policy.cloudfront_oac[0] will be created
  + resource "aws_s3_bucket_policy" "cloudfront_oac" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_static_website.aws_s3_bucket_policy.website[0] will be created
  + resource "aws_s3_bucket_policy" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_static_website.aws_s3_bucket_public_access_block.website will be created
  + resource "aws_s3_bucket_public_access_block" "website" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.s3_static_website.aws_s3_bucket_server_side_encryption_configuration.website will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_static_website.aws_s3_bucket_versioning.website will be created
  + resource "aws_s3_bucket_versioning" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_static_website.aws_s3_bucket_website_configuration.website[0] will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.security.aws_iam_policy.cicd_policy[0] will be created
  + resource "aws_iam_policy" "cicd_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CI/CD operations"
      + id               = (known after apply)
      + name             = "nurlan-yagublu-dev-cicd-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-cicd-policy"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-cicd-policy"
          + "Project"     = "nurlan-yagublu"
        }
    }

  # module.security.aws_iam_policy.ecs_secrets_policy will be created
  + resource "aws_iam_policy" "ecs_secrets_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ECS to access secrets"
      + id               = (known after apply)
      + name             = "nurlan-yagublu-dev-ecs-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-ecs-secrets-policy"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-ecs-secrets-policy"
          + "Project"     = "nurlan-yagublu"
        }
    }

  # module.security.aws_iam_policy.ecs_task_policy will be created
  + resource "aws_iam_policy" "ecs_task_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ECS tasks"
      + id               = (known after apply)
      + name             = "nurlan-yagublu-dev-ecs-task-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-ecs-task-policy"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-ecs-task-policy"
          + "Project"     = "nurlan-yagublu"
        }
    }

  # module.security.aws_iam_role.cicd[0] will be created
  + resource "aws_iam_role" "cicd" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:nurlanyagublu/infrastructure:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = ""
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev-cicd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-cicd"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-cicd"
          + "Project"     = "nurlan-yagublu"
        }
      + unique_id             = (known after apply)
    }

  # module.security.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-ecs-task"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-ecs-task"
          + "Project"     = "nurlan-yagublu"
        }
      + unique_id             = (known after apply)
    }

  # module.security.aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev-ecs-task-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-ecs-task-execution"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-ecs-task-execution"
          + "Project"     = "nurlan-yagublu"
        }
      + unique_id             = (known after apply)
    }

  # module.security.aws_iam_role_policy_attachment.cicd_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cicd_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "nurlan-yagublu-dev-cicd"
    }

  # module.security.aws_iam_role_policy_attachment.ecs_secrets_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_secrets_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "nurlan-yagublu-dev-ecs-task-execution"
    }

  # module.security.aws_iam_role_policy_attachment.ecs_task_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "nurlan-yagublu-dev-ecs-task-execution"
    }

  # module.security.aws_iam_role_policy_attachment.ecs_task_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "nurlan-yagublu-dev-ecs-task"
    }

  # module.security.aws_kms_alias.main will be created
  + resource "aws_kms_alias" "main" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/nurlan-yagublu-dev"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.security.aws_kms_key.main will be created
  + resource "aws_kms_key" "main" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for nurlan-yagublu dev"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-kms-key"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-kms-key"
          + "Project"     = "nurlan-yagublu"
        }
    }

  # module.security.aws_secretsmanager_secret.app_secrets will be created
  + resource "aws_secretsmanager_secret" "app_secrets" {
      + arn                            = (known after apply)
      + description                    = "Application secrets for nurlan-yagublu dev"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "nurlan-yagublu/dev/app-secrets"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-app-secrets"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-app-secrets"
          + "Project"     = "nurlan-yagublu"
        }
    }

  # module.security.aws_secretsmanager_secret_version.app_secrets will be created
  + resource "aws_secretsmanager_secret_version" "app_secrets" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.security.aws_ssm_parameter.app_config["app_name"] will be created
  + resource "aws_ssm_parameter" "app_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/nurlan-yagublu/dev/app_name"
      + tags           = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-app_name"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-app_name"
          + "Project"     = "nurlan-yagublu"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.security.aws_ssm_parameter.app_config["log_level"] will be created
  + resource "aws_ssm_parameter" "app_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/nurlan-yagublu/dev/log_level"
      + tags           = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-log_level"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-log_level"
          + "Project"     = "nurlan-yagublu"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.security.aws_ssm_parameter.app_config["max_connections"] will be created
  + resource "aws_ssm_parameter" "app_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/nurlan-yagublu/dev/max_connections"
      + tags           = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-max_connections"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-max_connections"
          + "Project"     = "nurlan-yagublu"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.security.aws_ssm_parameter.app_config["session_timeout"] will be created
  + resource "aws_ssm_parameter" "app_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/nurlan-yagublu/dev/session_timeout"
      + tags           = {
          + "Environment" = "dev"
          + "Name"        = "nurlan-yagublu-dev-session_timeout"
          + "Project"     = "nurlan-yagublu"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-dev-session_timeout"
          + "Project"     = "nurlan-yagublu"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.security.random_password.api_key will be created
  + resource "random_password" "api_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.security.random_password.encryption_key will be created
  + resource "random_password" "encryption_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.security.random_password.flask_secret will be created
  + resource "random_password" "flask_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.security.random_password.jwt_secret will be created
  + resource "random_password" "jwt_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 62 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_fqdn                    = "dev-api.example.com"
  + app_fqdn                    = "dev-app.example.com"
  + certificate_arn             = (known after apply)
  + cicd_role_arn               = (known after apply)
  + cloudfront_distribution_id  = (known after apply)
  + cloudfront_domain_name      = (known after apply)
  + ecr_repository_arn          = (known after apply)
  + ecr_repository_name         = "nurlan-yagublu-dev-flask-api"
  + ecr_repository_url          = (known after apply)
  + ecs_ecs_cluster_id          = (known after apply)
  + ecs_task_execution_role_arn = (known after apply)
  + ecs_task_role_arn           = (known after apply)
  + environment                 = "dev"
  + hosted_zone_id              = (known after apply)
  + kms_key_arn                 = (known after apply)
  + region                      = "us-east-1"
  + s3_bucket_id                = (known after apply)
  + s3_website_endpoint         = (known after apply)
  + vpc_id                      = (known after apply)
  + website_url                 = (known after apply)

```

</details>

*Pusher: @nurlanyagublu, Action: `pull_request`*